Осуществим подключение к бд

In [50]:
%load_ext sql
%sql sqlite:///lab_2.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @lab_2.db'

In [ ]:
Создадим таблицу студентов, групп, городов и факультетов

In [2]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer
    GPA number
);

drop table if exists Faculties;
CREATE TABLE Faculties
(
id integer primary key,
name varchar(50)
);

drop table if exists Groups; 
Create table Groups
(
id integer primary key,
name varchar(50)
);

drop table if exists Cities; 
Create table Cities
(
id integer primary key,
name varchar(50)
);

 * sqlite:///lab_2.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [19]:
%%sql 
PRAGMA foreign_keys=ON

 * sqlite:///lab_2.db
Done.

[]

In [20]:
%%sql
DROP TABLE Students;
DROP TABLE Cities;
DROP TABLE Faculties;
DROP TABLE Groups;

 * sqlite:///lab_2.db
Done.
Done.
Done.
Done.

[]

## Задание 1 
Перепишите создание таблиц с учетом наличия внешних ключей

In [61]:
%%sql 
PRAGMA foreign_keys = ON;
drop table if exists Students;
drop table if exists Faculties;
drop table if exists Groups; 
drop table if exists Cities;
CREATE TABLE Faculties
(
id integer primary key,
name varchar(50)
);

Create table Groups
(
id integer primary key,
name varchar(50)
);

Create table Cities
(
id integer primary key,
name varchar(50)
);

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer,
    city_id integer,
    group_id integer,
    GPA number,
    FOREIGN KEY(Faculty_id) REFERENCES Faculties(id),
    FOREIGN KEY(city_id) REFERENCES Cities(id),
    FOREIGN KEY(group_id) REFERENCES Groups(id)
    
);

 * sqlite:///lab_2.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Задание 2
Осуществить вставку во все таблицы с учетом правил на внешние ключи

In [71]:
%%sql
insert into Groups(name) values("tksdkfnsdklfjghkj");
select id from Groups where name = "tkjghkj";

 * sqlite:///lab_2.db
1 rows affected.
Done.

[(2,)]

In [66]:
%%sql 
insert into Groups(name) values("asdadas");
insert into Faculties(name) values("jkfhekj");
insert into Cities(name) values("Ciakjdfkay");
insert into Students(name,secondname,faculty_id,city_id,group_id,gpa) 
values("asd","awejhd",
       (select id from Faculties where name="IT"),
       (select id from Cities where name="Spb"),
       (select id from Groups where name="KMBO-01-17"),3)

 * sqlite:///lab_2.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Задание 3
Вывести Имена Студентов, Названия их факультетов, групп и городов проживания

In [25]:
%%sql
select Students.name,
Faculties.name as faculty_name,
Groups.name as group_name,
Cities.name as city_name from Students 
INNER join Faculties on (Students.faculty_id=Faculties.id) 
INNER join Cities on (Students.city_id=Cities.id) 
INNER join Groups on (Students.group_id=Groups.id);

 * sqlite:///lab_2.db
Done.

[('Max', 'Kib', 'KMBO-01-17', 'Spb'),
 ('Ivan', 'Kib', 'KMBO-01-17', 'Moscow'),
 ('Sergey', 'Kib', 'KMBO-01-17', 'Moscow'),
 ('Max', 'Kib', 'KMBO-01-17', 'Moscow'),
 ('Diam', 'def', 'KMBO-04-17', 'Moscow'),
 ('iam', 'def', 'KMBO-03-17', 'Moscow')]

## Задание 4
Вывести имена всех студентов, обучающихся на факультет IT из Воронежа.

In [2]:
%%sql
select Students.name from students 
inner join Faculties on (Students.faculty_id=Faculties.id) 
inner join Cities on (Students.city_id=Cities.id) 
where Cities.name="Voronezh" and Faculties.name = "IT"

 * sqlite:///lab_2.db
Done.

[]

## Задание 5
Для всевозможных пар (Факультет, Город) вывести количество студентов, соответствующее данной группе

In [28]:
%%sql
select Faculties.name as faculty_name,
Cities.name as city_name,
count(*) cnt from Students
inner join Faculties on(Faculties.id=Students.faculty_id) 
inner join Cities on(Cities.id=Students.city_id)  
group by faculty_name,city_name

 * sqlite:///lab_2.db
Done.

[('Kib', 'Moscow', 3),
 ('Kib', 'Spb', 1),
 ('asd', 'Moscow', 2),
 ('def', 'Moscow', 3)]

## Задание 6 
Для всех групп вывести средний балл по группе для студентов, не проживающих в Москве, при условии, что количество таких студентов не менее 3

In [46]:
%%sql
select Groups.name as group_name,
Cities.name as city_name,
count(*) cnt,
AVG(Students.gpa) as gpa_avg from Students
inner join Cities on(Cities.id=Students.city_id) 
inner join Groups on(Groups.id=Students.group_id) 
where city_name != "Moscow"
group by group_name having count(group_name)>=3

 * sqlite:///lab_2.db
Done.

[('KMBO-01-17', 'Spb', 5, 5.8)]

In [37]:
%%sql 
select * from Students

 * sqlite:///lab_2.db
Done.

[(1, 'iam', 'ercsd', 1, 1, 1, 4),
 (2, 'asdwf', 'awejhd', 1, 1, 1, 4),
 (3, 'aksjdw', 'awejhd', 1, 1, 1, 4),
 (4, 'oier', 'awejhd', 1, 1, 1, 6),
 (5, 'Petya', 'awejhd', 1, 2, 1, 6),
 (6, 'Vanya', 'awejhd', 1, 2, 1, 2),
 (7, 'Lenya', 'awejhd', 1, 2, 1, 9),
 (8, 'Sasha', 'awejhd', 1, 2, 1, 9),
 (9, 'Vanya', 'awejhd', 1, 2, 1, 3)]